app/Http/Controllers/Auth/AuthenticatedSessionController.php

select * from `users` where `email` = 'company@example.com' limit 1
select * from `users` where `id` = 1 limit 1
---
    public function store(LoginRequest $request)
    {

        $user = User::where('email',$request->email)->first();
        if($user != null)
        {
            $companyUser = User::where('id' , $user->created_by)->first();

select * from `users` where `users`.`id` = 1 limit 1
---
        $request->session()->regenerate();
        $user = Auth::user();

        $companyUser = User::find($user->created_by);

select * from `plans` where `plans`.`id` = 1 limit 1
---
        $user = \Auth::user();
        if(isset($user->type) && $user->type == 'company')
        {
            $plan = Plan::find($user->plan);

update `users` set `last_login_at` = '2025-01-11 07:11:16', `users`.`updated_at` = '2025-01-11 07:11:16' where `id` = 2
---
        date_default_timezone_set($timezone);

        // Update Last Login Time
        $user->update(
            [
                'last_login_at' => Carbon::now()->toDateTimeString(),
            ]
        );