app/Http/Controllers/ChartOfAccountTypeController.php

    public function index()
    {
        if(\Auth::user()->can('manage constant chart of account type'))
        {
            $types = ChartOfAccountType::where('created_by', '=', \Auth::user()->creatorId())->get();
            $account_subtype = [];
            foreach ($types as $type) {
                $typeName=$type->name;
                $typeId=$type->id;
                $accountTypes = ChartOfAccountSubType::where('type', $type->id)->where('created_by',\Auth::user()->creatorId())->get();
---
select * from `chart_of_account_types` where `created_by` = 2
select * from `chart_of_account_sub_types` where `type` = 1 and `created_by` = 2