app/Http/Controllers/InvoiceController.php

select * from `invoice_products` where `invoice_id` = '4' and `product_id` = '1' limit 1
---
    public function items(Request $request)
    {
        $items = InvoiceProduct::where('invoice_id', $request->invoice_id)->where('product_id', $request->product_id)->first();