app/Http/Controllers/PurchaseController.php

    public function create($vendorId = 0)
    {
        if(\Auth::user()->can('create purchase'))
        {
            $customFields = CustomField::where('created_by', '=', \Auth::user()->creatorId())->where('module', '=', 'purchase')->get();
---
select * from `custom_fields` where `created_by` = 2 and `module` = 'purchase'

    function purchaseNumber()
    {
        $latest = Purchase::where('created_by', '=', \Auth::user()->creatorId())->latest()->first();
---
select * from `purchases` where `created_by` = 2 order by `created_at` desc limit 1

    public function product(Request $request)
    {
        $data['product']     = $product = ProductService::find($request->product_id);
---
select * from `product_services` where `product_services`.`id` = '16' limit 1