app/Models/Utility.php

select * from `settings` where `created_by` = 1
---
    public static function getSetting()
    {
        if (self::$getsettings == null) {
            $data = DB::table('settings');
            $data = $data->where('created_by', '=', 1)->get();

select * from `settings` where `created_by` = 2
select * from `settings` where `created_by` = 1
---
    public static function getSettingById($id)
    {
        if (self::$getsettingsid == null) {
            $data = DB::table('settings');
            $data = $data->where('created_by', '=', $id)->get();
            if (count($data) == 0) {
                $data = DB::table('settings')->where('created_by', '=', 1)->get();

select `full_name`, `code` from `languages`
---
    public static function languages()
    {
        if (self::$languageSetting == null) {
            $languages = Utility::langList();


            if (\Schema::hasTable('languages')) {
                $settings = Utility::settings();
                if (!empty($settings['disable_lang'])) {
                    $disabledlang = explode(',', $settings['disable_lang']);
                    $languages = Language::whereNotIn('code', $disabledlang)->pluck('full_name', 'code');
                } else {
                    $languages = Language::pluck('full_name', 'code');

select * from `taxes` where `taxes`.`id` = '0' limit 1
---
    public static function tax($taxes)
    {
        // if (self::$taxsData == null) {
        $taxArr = explode(',', $taxes);
        $taxes = [];
        foreach ($taxArr as $tax) {
            $taxes[] = Tax::find($tax);

select * from `taxes`
---
    public static function getTaxData()
    {
        $data = [];
        if (self::$rates == null) {
            $rates = Tax::get();

select * from `taxes` where `taxes`.`id` = '0' limit 1
---
    public static function totalTaxRate($taxes)
    {

        // if (self::$taxRateData == null) {
        $taxArr = explode(',', $taxes);
        $taxRate = 0;
        foreach ($taxArr as $tax) {
            $tax = Tax::find($tax);

select * from `admin_payment_settings`
---
    public static function getAdminPaymentSetting()
    {

        $data = \DB::table('admin_payment_settings');

        $settings = [];
        if (\Auth::check()) {

            $user_id = 1;
            $data = $data->where('created_by', '=', $user_id);

        }
        $data = $data->get();

select `value`, `name` from `settings` where `created_by` = 2
select * from `users` where `type` = 'super admin' limit 1
---
    public static function colorset()
    {
        if (\Auth::check()) {
            if (\Auth::user()->type == 'super admin') {
                $user = \Auth::user();
                $setting = DB::table('settings')->where('created_by', $user->id)->pluck('value', 'name')->toArray();
            } else {
                $setting = DB::table('settings')->where('created_by', \Auth::user()->creatorId())->pluck('value', 'name')->toArray();
            }
        } else {
            $user = User::where('type', 'super admin')->first();

select * from `settings` where `created_by` = 1
---
    public static function getStorageSetting()
    {
        $data = DB::table('settings');
        $data = $data->where('created_by', '=', 1);
        $data = $data->get();

select * from `settings` where `name` in ('enable_cookie', 'cookie_logging', 'cookie_title', 'cookie_description', 'necessary_cookies', 'strictly_cookie_title', 'strictly_cookie_description', 'more_information_description', 'contactus_url')
---
    public static function getCookieSetting()
    {
        $data = \DB::table('settings')->whereIn('name', ['enable_cookie', 'cookie_logging', 'cookie_title',
            'cookie_description', 'necessary_cookies', 'strictly_cookie_title',
            'strictly_cookie_description', 'more_information_description', 'contactus_url'])->get();